<a href="https://colab.research.google.com/github/zacksnyder-lsds/Unit_1_build_week/blob/master/Unit_1_build_week.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Reading in the data and initial cleaning

In [0]:
#Imports for the data reading and initial cleaning section 
import pandas as pd

In [0]:
#reading in the datasets I split in a seperate notebook so I could upload to github 
url1 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva1%20(1).csv'
url2 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva2.csv'
url3 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva3.csv'
url4 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva4.csv'
url5 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva5.csv'
url6 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva6.csv'
url7 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva7.csv'
url8 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva8.csv'
url9 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva9.csv'
url10 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva10.csv'

In [0]:
#converting the csv files back to dataframes for use 
kiva1 = pd.read_csv(url1)
kiva2 = pd.read_csv(url2)
kiva3 = pd.read_csv(url3)
kiva4 = pd.read_csv(url4)
kiva5 = pd.read_csv(url5)
kiva6 = pd.read_csv(url6)
kiva7 = pd.read_csv(url7)
kiva8 = pd.read_csv(url8)
kiva9 = pd.read_csv(url9)
kiva10 = pd.read_csv(url10)

In [4]:
#checking to make sure all the data read in smoothly 
[print(name.shape) for name in [kiva1,kiva2,kiva3,kiva4,kiva5,kiva6,kiva7,kiva8,kiva9,kiva10]]
kiva2.head()

(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67125, 21)

   Unnamed: 0       id  ...  repayment_interval        date
0       67120  1081611  ...           irregular  2014-06-03
1       67121   719419  ...           irregular  2014-06-03
2       67122   719437  ...           irregular  2014-06-03
3       67123   719717  ...             monthly  2014-06-03
4       67124   719548  ...             monthly  2014-06-03

[5 rows x 21 columns]

In [5]:
#concatinating the dataframes back together to the original from Kaggle 
kiva = pd.concat([kiva1,kiva2,kiva3,kiva4,kiva5,kiva6,kiva7,kiva8,kiva9,kiva10])
kiva.reset_index()
print(kiva.shape)
kiva.sample(5)

(671205, 21)

       Unnamed: 0       id  ...  repayment_interval        date
10163      211523   859517  ...           irregular  2015-03-21
38663      307143   954480  ...             monthly  2015-09-28
7829       544789  1205334  ...              bullet  2016-12-18
17093      151333   799923  ...           irregular  2014-11-18
26681       26681   679463  ...           irregular  2014-03-05

[5 rows x 21 columns]

In [6]:
#getting rid of the previous index column renamed unanamed 0 
kiva.drop('Unnamed: 0', axis=1, inplace=True)
kiva.sample(5)

            id  funded_amount  ...  repayment_interval        date
35883  1165669          250.0  ...           irregular  2016-10-11
765    1084589          125.0  ...             monthly  2014-10-19
20275   739159         1200.0  ...             monthly  2014-07-15
49561  1179426         1675.0  ...             monthly  2016-11-03
10859  1088162          350.0  ...             monthly  2015-03-23

[5 rows x 20 columns]

#Deeper Cleaning

###grabbing just the top 25 countries

In [16]:
#finding the top 25 countries that Kiva serves 
top_code = kiva['country_code'].value_counts()[:26].index
top_code

Index(['PH', 'KE', 'SV', 'KH', 'PK', 'PE', 'CO', 'UG', 'TJ', 'EC', 'PY', 'NI',
       'IN', 'VN', 'NG', 'BO', 'LB', 'AM', 'PS', 'WS', 'GT', 'RW', 'ML', 'HN',
       'ID', 'US'],
      dtype='object')

In [8]:
#creating a column for top 25 countries 
kiva['top_25_countries'] = 'Other'
kiva['top_25_countries'].sample(5)

28031    Other
37411    Other
36693    Other
9676     Other
63075    Other
Name: top_25_countries, dtype: object

In [28]:
#locking just the top 25 countries 
for code in top_code:
  kiva.loc[kiva['country_code'] == code, 'top_25_countries'] = code
kiva[['top_25_countries','country_code']].sample(10)

      top_25_countries country_code
40473               PH           PH
13679               GT           GT
57836               KE           KE
33644            Other           TG
2437                VN           VN
32996            Other           SL
58407               WS           WS
20562               PH           PH
5845                UG           UG
6163                UG           UG